In [1]:
import pandas as pd
import numpy as np
fortune=pd.read_csv("./course-files/Fortune_500_2017.csv",usecols=['Rank','Title','Employees','Profits','Assets'],index_col='Rank')
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [2]:
fortune['RankByEmployee']=fortune['Employees'].rank(ascending=False)

In [3]:
fortune['RankByProfits']=fortune['Profits'].rank(ascending=False)

In [4]:
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0

In [6]:
isEmployeesRankFirst10=fortune['RankByEmployee']<=10
isEmployeesRankFirst10.head()

Rank
1     True
2     True
3    False
4    False
5    False
Name: RankByEmployee, dtype: bool

In [9]:
isProfitRankFirst10=fortune['RankByProfits']<=10
isProfitRankFirst10.head()

Rank
1    False
2     True
3     True
4    False
5    False
Name: RankByProfits, dtype: bool

In [10]:
fortune[isProfitRankFirst10 & isEmployeesRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0

In [11]:
isEmployeesRankMore400=fortune['RankByEmployee']>=400

In [12]:
fortune[isEmployeesRankMore400 & isProfitRankFirst10]

             Title  Employees  Profits  Assets  RankByEmployee  RankByProfits
Rank
148   Altria Group       8300  14239.0   45932           424.0           10.0